#pragma once

// Zedfest (0.811) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace ZF
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct TabStruct.TabStruct
// 0x0038
struct FTabStruct
{
	struct FText                                       TabLabel_2_A155FB47437233D38890CD9E34E343ED;              // 0x0000(0x0018) (Edit, BlueprintVisible)
	class UClass*                                      TabPanelWidget_11_446DAF594342D0856BE105B7934446F9;       // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               AddSeperatorAfter_9_07CE597D41B9E4574518B9B47DAA9EC5;     // 0x0020(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0021(0x0007) MISSED OFFSET
	struct FString                                     OnClickEvent_15_2507C34A4CF6F0A153444CB8795939D9;         // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
