#pragma once

<<<<<<< HEAD
// Zedfest (0.804) SDK
=======
// Zedfest (0.763) SDK
>>>>>>> 797536caccfe399b6e4d522f8bf7978365d4b985

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace ZF
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct ItemInfo.ItemInfo
// 0x0058
struct FItemInfo
{
	struct FString                                     Name_10_86133AAC4D3E8CFDEE4FA89554C07A16;                 // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Description_11_4E6B21D049D44A35404DDE861D5A253C;          // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UTexture2D*                                  Icon_17_8AAD554B47E8F1796F7AEA8F61E3F836;                 // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     RarityCategory_20_1279282F49A905B237A9848A24EDA1D1;       // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FLinearColor                                RarityColor_21_470D7A154E74A1957916D880E2ACB197;          // 0x0038(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Amount_19_18C874BD4F0CD210FA74E495C75DD8D1;               // 0x0048(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
