#pragma once

<<<<<<< HEAD
// Zedfest (0.804) SDK
=======
// Zedfest (0.763) SDK
>>>>>>> 797536caccfe399b6e4d522f8bf7978365d4b985

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace ZF
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct CraftingStationData.CraftingStationData
// 0x0014
struct FCraftingStationData
{
	float                                              TimertouseCraftingStation_12_E75516974E0D4BC435C5DEB036E019F9;// 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TimertoUpgradetoUncommon_3_F17DF5AB4B193F51352139A3CCE9E27C;// 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TimertoUpgradetoRare_5_592808AF43E31906CC09FBACB52F5A43;  // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TimertoUpgradetoEpic_7_27C23DD444C91811D5F035809227432E;  // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TimertoUpgradetoLegendary_9_BE2C0B6A4F12876D1F9B95B7E3B55D7C;// 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
