#pragma once

<<<<<<< HEAD
// Zedfest (0.804) SDK
=======
// Zedfest (0.763) SDK
>>>>>>> 797536caccfe399b6e4d522f8bf7978365d4b985

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace ZF
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct PlayableLevels.PlayableLevels
// 0x0058
struct FPlayableLevels
{
	struct FText                                       Level_Name_8_2643BBC94E67561343C55FA71817E022;            // 0x0000(0x0018) (Edit, BlueprintVisible)
	class UTexture2D*                                  Level_Image_5_AC4A14A240712EAA0ACEBF8846AFD038;           // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       Level_Raw_Name_9_DC63BF4A412172B01E742BBA5F8B1E71;        // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FText                                       Level_Description_13_C4793EFF4D84EB7389B7FDA7F372986B;    // 0x0028(0x0018) (Edit, BlueprintVisible)
	struct FText                                       Level_TransitionMap_20_00BD8EF1401975006BD4299BC82C2AF5;  // 0x0040(0x0018) (Edit, BlueprintVisible)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
