#pragma once

// Zedfest (0.763) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace ZF
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct WeaponInfo.WeaponInfo
// 0x0080
struct FWeaponInfo
{
	struct FString                                     Row1Text1_16_80B9B32749B6C034949FBDB14EFC82EA;            // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Row1Text2_17_A2B264664923897A31905CAE27F0DD8B;            // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Row2Text1_18_B197294C4F7421DAD63CB4AB382FCDAF;            // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Row2Text2_19_1116A39743771C42760ABA9877C03B75;            // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Row3Text1_20_CC8AE2EE47BEA5C187B8479DE1810A43;            // 0x0040(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Row3Text2_22_3932DA5C492F487F5568B4B81B1B9D4C;            // 0x0050(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Row4Text1_24_ABD2826343DC1003C351A68DD84B38B0;            // 0x0060(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Row4Text2_26_74788CC940B6534101A7609D8F204C63;            // 0x0070(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
