#pragma once

// Zedfest (0.811) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace ZF
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct RaritiesData.RaritiesData
// 0x0460
struct FRaritiesData
{
	struct FLinearColor                                Common_15_364850C3447D37B398384CA2352B0DF7;               // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Uncommon_16_CB3B4E5A4BD86BAAEEB62CB5EB75601A;             // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Rare_17_17602B1C4819745E3AAED5B262CA4AFF;                 // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Epic_18_BE0E9B36484FCDAA371B788D41748AFE;                 // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Legendary_19_DE64C2C441C69AEF5AA909843E5765CE;            // 0x0040(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl6_23_379D82744149EA0F1366DC82F1984FB8;                 // 0x0050(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl7_25_947240554E05D02625DE71A1B9669EDA;                 // 0x0060(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl8_27_E080259E46AA18E2E4B58BA9649BB7C5;                 // 0x0070(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl9_29_F0E2F32D42138706753DF09EADF70A3B;                 // 0x0080(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl10_31_A13BC54F453D8E0E26068EBE4F1E188C;                // 0x0090(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl11_34_0B0B62604FA1CCE9E756BD8B648DA476;                // 0x00A0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl12_36_53992C934440C652BE5E58BFCB04B3C4;                // 0x00B0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl13_38_E1CB7A6246328849E1E90EAF058B5831;                // 0x00C0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl14_40_6B8CB9AF4058AE7E3D4CD09F6505BE9D;                // 0x00D0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl15_42_94E1EC1749BDE534EDF5D5838CF849C5;                // 0x00E0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl16_44_4B619EDA40BE78926682C1B27DBEC2C7;                // 0x00F0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl17_46_6C4450BF4B830AD13163F080AFCBA41B;                // 0x0100(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl18_48_0B07788842559F193B5179B1FB965CE3;                // 0x0110(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl19_50_419DAD254502FD07D0708E9D230A73BE;                // 0x0120(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl20_52_279E7F7942FBFB8C0D68D69F7A398A08;                // 0x0130(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl21_59_0CBC5ECB45816DEDE292098A046B3A90;                // 0x0140(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl22_60_996F4D554F84344255F8489BF64C7192;                // 0x0150(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl23_61_8F3A670A4DE98C1CC92F729FADAF4556;                // 0x0160(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl24_62_9CA70BA34A95B19B09B0C88E696149EC;                // 0x0170(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl25_63_A3666B8441D07D5FCE943C9BB9DF9A27;                // 0x0180(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl26_64_3332B68E48534CA1528F7AA746162311;                // 0x0190(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl27_107_D3B5A8364265F4700CDD8E935EFE62EB;               // 0x01A0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl28_108_7A558C5B4884E4DD0E75FDBC7BCFF1AB;               // 0x01B0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl29_109_DB68CCB64936E26084E17BAFF0DF5934;               // 0x01C0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl30_110_5DD4CB594939569E7C73C8BDCBA7B8ED;               // 0x01D0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl31_111_AE8FB29F42999579EA39BFAFC85ECB38;               // 0x01E0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl32_112_9144B83E4EED9701100F4BA277F3D955;               // 0x01F0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl33_113_31E00D6B49660E6256268CB0925E21A8;               // 0x0200(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl34_114_BCD7DDAF4CC05E2D44EB9788CD7C0B22;               // 0x0210(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl35_115_8D592B12427E7B0B4FFE6F8703CC2DB0;               // 0x0220(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl36_116_37D616DF420759EEDE2915B138A7273C;               // 0x0230(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl37_117_095DA15947DFA61449844DB77A260B0B;               // 0x0240(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl38_118_163A8F544DB987C3AD6E378F05010373;               // 0x0250(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl39_119_801E16B642116C3259CDDEA27181ACCE;               // 0x0260(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl40_120_AFDEA6B3455AE4E651C6B88BE8A871D9;               // 0x0270(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl41_121_326541B64C48426EA8B91C88AB7A446B;               // 0x0280(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl42_122_C6D3D91343CE42965B090FA6A8B5BA60;               // 0x0290(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl43_123_831CC29C4A9E55D26680FFA5B0BF2EC5;               // 0x02A0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl44_124_C760907F4529300A67DC028D2D285E93;               // 0x02B0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl45_125_3B5857BF449C9D0DB5236BB0B978AECA;               // 0x02C0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl46_126_26D7D37F4B1A817A7B0E79B4EA8D296A;               // 0x02D0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl47_127_BF6075CC48BF7405595C6EB314B6129F;               // 0x02E0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl48_128_CD515C6845A65492E3C92BA043462E3E;               // 0x02F0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl49_129_6D520EC34702D39E844D7793E85A1B56;               // 0x0300(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl50_130_FDC57F7D410E1DD3884B1E9BBB9E5A32;               // 0x0310(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl51_131_0EA3225744D25D6364DE5AA8C904C9EB;               // 0x0320(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl52_132_4C8365574E740C01DBAE5DB94936388C;               // 0x0330(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl53_133_40F359A9469222B59B539AA5CDFF55D0;               // 0x0340(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl54_134_C3360BBC4B64F60736B519A59C841BA6;               // 0x0350(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl55_135_8E2CE9D94D07A7A4C87197B014AFA979;               // 0x0360(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl56_136_6403F4B74706A2EE26A33591D6C81479;               // 0x0370(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl57_137_72A53E304B4D09888AE0C9971F8ADC8E;               // 0x0380(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl58_138_D2D7B7224132472F9806ABAFF820067C;               // 0x0390(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl59_139_7E8AB26F4A8B835642B555B27E02E615;               // 0x03A0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl60_140_87FC48344BC622AEB2799C85951C0C8B;               // 0x03B0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl61_141_642949B84339D7828729CE8185E27280;               // 0x03C0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl62_142_5B051A3845A0CCBEF88C6C90AFFC1AD5;               // 0x03D0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl63_143_8651950B4F7C3838002EEA9A8A711973;               // 0x03E0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl64_144_14824B0A4B2F8070F5CC2CAF56E1DEEB;               // 0x03F0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl65_145_232FD31F4C5959D34CF70290B6A406ED;               // 0x0400(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl66_146_58812C284FA363CDAD5A3F826780FCC6;               // 0x0410(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl67_147_5C0A399E40A9EF8E720F68934461B830;               // 0x0420(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl68_148_D23F88DB4EEED98406D24FBD7C50A82C;               // 0x0430(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl69_151_89E420B44F2D341192239098302D5693;               // 0x0440(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl70_152_3049CBFD4CA2701179ED7BBB640B838F;               // 0x0450(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
