#pragma once

<<<<<<< HEAD
// Zedfest (0.804) SDK
=======
// Zedfest (0.763) SDK
>>>>>>> 797536caccfe399b6e4d522f8bf7978365d4b985

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace ZF
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct RaritiesData.RaritiesData
// 0x00A0
struct FRaritiesData
{
	struct FLinearColor                                Common_15_364850C3447D37B398384CA2352B0DF7;               // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Uncommon_16_CB3B4E5A4BD86BAAEEB62CB5EB75601A;             // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Rare_17_17602B1C4819745E3AAED5B262CA4AFF;                 // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Epic_18_BE0E9B36484FCDAA371B788D41748AFE;                 // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Legendary_19_DE64C2C441C69AEF5AA909843E5765CE;            // 0x0040(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl6_23_379D82744149EA0F1366DC82F1984FB8;                 // 0x0050(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl7_25_947240554E05D02625DE71A1B9669EDA;                 // 0x0060(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl8_27_E080259E46AA18E2E4B58BA9649BB7C5;                 // 0x0070(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl9_29_F0E2F32D42138706753DF09EADF70A3B;                 // 0x0080(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Lvl10_31_A13BC54F453D8E0E26068EBE4F1E188C;                // 0x0090(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
