#pragma once

<<<<<<< HEAD
// Zedfest (0.804) SDK
=======
// Zedfest (0.763) SDK
>>>>>>> 797536caccfe399b6e4d522f8bf7978365d4b985

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace ZF
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct NavItemCustomActionStruct.NavItemCustomActionStruct
// 0x0050
struct FNavItemCustomActionStruct
{
	struct FString                                     OnUp_13_BD42F57C416E1C133A6CC1BC6F0A8335;                 // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     OnDown_14_95B155D642DDC56C4E1726B2CCECF98F;               // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     OnRight_15_70316DE74755558EF0B282AB83F5F2D9;              // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     OnLeft_16_BD46AE704A395659053DF080CDD23545;               // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     OnEnter_17_59504D61409CB936D41C32B14F57D83B;              // 0x0040(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
